############## NET - IOSTANDARD ##################
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property BITSTREAM.CONFIG.UNUSEDPIN PULLUP [current_design]
#############SPI Configurate Setting ##################
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property CONFIG_MODE SPIx4 [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 50 [current_design]
############## clock and reset define##################
#create_generated_clock -name adc_process_clk -source [get_pins lvds_irx0/CLK] -divide_by 2 [get_pins fft0/adc_processClock_BUFG]

set_property IOSTANDARD LVCMOS33 [get_ports SYS_clk]
set_property PACKAGE_PIN M21 [get_ports SYS_clk]
set_property PACKAGE_PIN B5 [get_ports ADC_bitclk_P]
set_property PACKAGE_PIN A5 [get_ports ADC_bitclk_N]
set_property PACKAGE_PIN B4 [get_ports ADC_frame_P]
set_property PACKAGE_PIN A4 [get_ports ADC_frame_N]
set_property PACKAGE_PIN E6 [get_ports ADC_idataL_P]
set_property PACKAGE_PIN D6 [get_ports ADC_idataL_N]
set_property PACKAGE_PIN G4 [get_ports ADC_qdataL_P]
set_property PACKAGE_PIN F4 [get_ports ADC_qdataL_N]
set_property PACKAGE_PIN E5 [get_ports ADC_idataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_idataH_P]
set_property PACKAGE_PIN J4 [get_ports ADC_qdataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_qdataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_frame_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_idataL_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_qdataL_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_bitclk_P]
set_property PACKAGE_PIN H7 [get_ports Key0]
set_property PACKAGE_PIN M6 [get_ports Key1]
set_property IOSTANDARD LVCMOS18 [get_ports Key0]
set_property IOSTANDARD LVCMOS18 [get_ports Key1]
set_disable_timing [get_ports Key0]
set_disable_timing [get_ports Key1]

#set_property IODELAY_GROUP DDR_GROUP [get_cells idelay_Q0]
#set_property IODELAY_GROUP "DDR_GROUP" [get_ports {ADC_frame_P}]
#set_property IODELAY_GROUP "DDR_GROUP" [get_clocks {clk_ref}]
############## HDMIOUT define##################
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports TMDS_clk_n]
#set_property PACKAGE_PIN D4 [get_ports TMDS_clk_p]
#set_property PACKAGE_PIN C4 [get_ports TMDS_clk_n]
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports TMDS_clk_p]

#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[0]}]
#set_property PACKAGE_PIN E1 [get_ports {TMDS_data_p[0]}]
#set_property PACKAGE_PIN D1 [get_ports {TMDS_data_n[0]}]
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[0]}]

#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[1]}]
#set_property PACKAGE_PIN F2 [get_ports {TMDS_data_p[1]}]
#set_property PACKAGE_PIN E2 [get_ports {TMDS_data_n[1]}]
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[1]}]

#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[2]}]
#set_property PACKAGE_PIN G2 [get_ports {TMDS_data_p[2]}]
#set_property PACKAGE_PIN G1 [get_ports {TMDS_data_n[2]}]
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[2]}]

############## SPI PORT ###################
set_property PACKAGE_PIN T19 [get_ports SPI_clk]
set_property PACKAGE_PIN U19 [get_ports SPI_miso]
set_property PACKAGE_PIN U20 [get_ports SPI_mosi]


################ CLOCKS ####################
create_clock -period 16.666 -name ADC_bitclk_P -waveform {0.000 8.333} -add [get_ports ADC_bitclk_P]
create_clock -period 50.000 -name ADC_frame_P -waveform {4.166 29.166} -add [get_ports ADC_frame_P]
create_generated_clock -name fclk_delayed -source [get_pins lvds_irx0/fclk_delayed_reg/C] -multiply_by 1 -add -master_clock ADC_bitclk_P [get_pins lvds_irx0/fclk_delayed_reg/Q]

create_clock -period 20.000 -name SPI_Clock -waveform {0.000 10.000} -add [get_ports SPI_clk]
set_input_delay -clock [get_clocks SPI_Clock] -add_delay 5.000 [get_ports SPI_clk]
set_clock_groups -name SPI_SYS_clk -asynchronous -group [get_clocks {SPI_Clock SYS_clk}]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets SPI_clk_IBUF]

set_input_delay -clock [get_clocks ADC_bitclk_P] 2.000 [get_ports ADC_idataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] 2.000 [get_ports ADC_idataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] 2.000 [get_ports ADC_qdataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] 2.000 [get_ports ADC_qdataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] 4.000 [get_ports ADC_frame_P]

set_property IOSTANDARD LVCMOS33 [get_ports SPI_clk]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_miso]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_mosi]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_nss]

set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_byteOut[0]}]

set_property PACKAGE_PIN AB26 [get_ports {o_byteOut[0]}]
set_property PACKAGE_PIN AC26 [get_ports {o_byteOut[1]}]
set_property PACKAGE_PIN AB24 [get_ports {o_byteOut[2]}]
set_property PACKAGE_PIN AC24 [get_ports {o_byteOut[3]}]
set_property PACKAGE_PIN AA24 [get_ports {o_byteOut[4]}]
set_property PACKAGE_PIN AB25 [get_ports {o_byteOut[5]}]
set_property PACKAGE_PIN AA22 [get_ports {o_byteOut[6]}]
set_property PACKAGE_PIN AA23 [get_ports {o_byteOut[7]}]
set_property PACKAGE_PIN Y25 [get_ports o_byteOutStrobe]
set_property IOSTANDARD LVCMOS33 [get_ports o_byteOutStrobe]
set_property DRIVE 12 [get_ports SPI_miso]
set_property PACKAGE_PIN W21 [get_ports sig_valid]
set_property IOSTANDARD LVCMOS33 [get_ports sig_valid]
set_property DRIVE 12 [get_ports sig_valid]

set_property MARK_DEBUG true [get_nets receiver_rst]
set_property MARK_DEBUG true [get_nets o_state]

set_property PACKAGE_PIN W25 [get_ports {o_state[0]}]
set_property PACKAGE_PIN Y26 [get_ports {o_state[1]}]
set_property PACKAGE_PIN Y22 [get_ports {o_state[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_state[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_state[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_state[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {o_state[0]}]
set_property PACKAGE_PIN Y23 [get_ports {o_state[3]}]
set_property PACKAGE_PIN Y21 [get_ports o_short_sync]
set_property IOSTANDARD LVCMOS33 [get_ports o_short_sync]


set_clock_groups -asynchronous -group [get_clocks [list ADC_bitclk_P [get_clocks -of_objects [get_pins clk_system_inst/inst/mmcm_adv_inst/CLKOUT3]]]]
set_false_path -from [get_clocks ADC_bitclk_P] -to [get_clocks -of_objects [get_pins clk_system_inst/inst/mmcm_adv_inst/CLKOUT3]]

set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_i_counter_reg[4]/C}]
set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_i_counter_reg[5]/C}]
set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_q_counter_reg[5]/C}]
set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_q_counter_reg[3]/C}]
set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_i_counter_reg[3]/C}]
set_false_path -from [get_pins {signal_watchdog_inst/small_abs_eq_q_counter_reg[4]/C}]
#set_false_path -from [get_pins dot11_inst/pkt_header_valid_reg/C]
set_false_path -from [get_pins signal_watchdog_inst/receiver_rst_reg_reg/C]

set_false_path -from [get_pins dot11_inst/sync_long_reset_reg/C]

set_property PACKAGE_PIN T20 [get_ports SPI_nss]
set_property PACKAGE_PIN AA25 [get_ports o_dcmi_frame]
set_property IOSTANDARD LVCMOS33 [get_ports o_dcmi_frame]
set_property PACKAGE_PIN AA25 [get_ports o_DCMI_vsync]
set_property PACKAGE_PIN W21 [get_ports o_DCMI_hsync]
set_property IOSTANDARD LVCMOS33 [get_ports o_DCMI_hsync]
set_property IOSTANDARD LVCMOS33 [get_ports o_DCMI_vsync]
set_property PACKAGE_PIN V26 [get_ports o_DCMI_hsync]

