############## NET - IOSTANDARD ##################
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property BITSTREAM.CONFIG.UNUSEDPIN PULLUP [current_design]
#############SPI Configurate Setting##################
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property CONFIG_MODE SPIx4 [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 50 [current_design]
############## clock and reset define##################
#create_generated_clock -name adc_process_clk -source [get_pins lvds_irx0/CLK] -divide_by 2 [get_pins fft0/adc_processClock_BUFG]

set_property IOSTANDARD LVCMOS33 [get_ports SYS_clk]
set_property PACKAGE_PIN M21 [get_ports SYS_clk]
set_property PACKAGE_PIN B5 [get_ports ADC_bitclk_P]
set_property PACKAGE_PIN A5 [get_ports ADC_bitclk_N]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets lvds_dclk_BUFDS]
set_property PACKAGE_PIN B4 [get_ports ADC_frame_P]
set_property PACKAGE_PIN A4 [get_ports ADC_frame_N]
set_property PACKAGE_PIN E6 [get_ports ADC_idataL_P]
set_property PACKAGE_PIN D6 [get_ports ADC_idataL_N]
set_property PACKAGE_PIN G4 [get_ports ADC_qdataL_P]
set_property PACKAGE_PIN F4 [get_ports ADC_qdataL_N]
set_property PACKAGE_PIN E5 [get_ports ADC_idataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_idataH_P]
set_property PACKAGE_PIN J4 [get_ports ADC_qdataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_qdataH_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_frame_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_idataL_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_qdataL_P]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ADC_bitclk_P]
set_property PACKAGE_PIN H7 [get_ports Key0]
set_property PACKAGE_PIN M6 [get_ports Key1]
set_property IOSTANDARD LVCMOS18 [get_ports Key0]
set_property IOSTANDARD LVCMOS18 [get_ports Key1]
set_disable_timing [get_ports Key0]
set_disable_timing [get_ports Key1]
#set_property IODELAY_GROUP DDR_GROUP [get_cells idelay_Q0]
#set_property IODELAY_GROUP "DDR_GROUP" [get_ports {ADC_frame_P}]
#set_property IODELAY_GROUP "DDR_GROUP" [get_clocks {clk_ref}]
############## HDMIOUT define##################
set_property IOSTANDARD DIFF_SSTL18_I [get_ports TMDS_clk_n]
set_property PACKAGE_PIN D4 [get_ports TMDS_clk_p]
set_property PACKAGE_PIN C4 [get_ports TMDS_clk_n]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports TMDS_clk_p]

set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[0]}]
set_property PACKAGE_PIN E1 [get_ports {TMDS_data_p[0]}]
set_property PACKAGE_PIN D1 [get_ports {TMDS_data_n[0]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[0]}]

set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[1]}]
set_property PACKAGE_PIN F2 [get_ports {TMDS_data_p[1]}]
set_property PACKAGE_PIN E2 [get_ports {TMDS_data_n[1]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[1]}]

set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_n[2]}]
set_property PACKAGE_PIN G2 [get_ports {TMDS_data_p[2]}]
set_property PACKAGE_PIN G1 [get_ports {TMDS_data_n[2]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {TMDS_data_p[2]}]


#### DEBUG PINS
set_property IOSTANDARD LVCMOS33 [get_ports dbgFrameRdy]
set_property PACKAGE_PIN V18 [get_ports dbgFrameRdy]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutI[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {dbgOutQ[0]}]
set_property PACKAGE_PIN Y26 [get_ports {dbgOutI[11]}]
set_property PACKAGE_PIN W25 [get_ports {dbgOutI[10]}]
set_property PACKAGE_PIN AA25 [get_ports {dbgOutI[9]}]
set_property PACKAGE_PIN Y25 [get_ports {dbgOutI[8]}]
set_property PACKAGE_PIN AA22 [get_ports {dbgOutI[6]}]
set_property PACKAGE_PIN AA23 [get_ports {dbgOutI[7]}]
set_property PACKAGE_PIN AB25 [get_ports {dbgOutI[5]}]
set_property PACKAGE_PIN AA24 [get_ports {dbgOutI[4]}]
set_property PACKAGE_PIN AC24 [get_ports {dbgOutI[3]}]
set_property PACKAGE_PIN AB24 [get_ports {dbgOutI[2]}]
set_property PACKAGE_PIN AC26 [get_ports {dbgOutI[1]}]
set_property PACKAGE_PIN AB26 [get_ports {dbgOutI[0]}]
set_property PACKAGE_PIN W23 [get_ports {dbgOutQ[11]}]
set_property PACKAGE_PIN V23 [get_ports {dbgOutQ[10]}]
set_property PACKAGE_PIN W24 [get_ports {dbgOutQ[9]}]
set_property PACKAGE_PIN U26 [get_ports {dbgOutQ[7]}]
set_property PACKAGE_PIN W26 [get_ports {dbgOutQ[5]}]
set_property PACKAGE_PIN Y21 [get_ports {dbgOutQ[3]}]
set_property PACKAGE_PIN Y23 [get_ports {dbgOutQ[1]}]
set_property PACKAGE_PIN V24 [get_ports {dbgOutQ[8]}]
set_property PACKAGE_PIN U25 [get_ports {dbgOutQ[6]}]
set_property PACKAGE_PIN V26 [get_ports {dbgOutQ[4]}]
set_property PACKAGE_PIN W21 [get_ports {dbgOutQ[2]}]
set_property PACKAGE_PIN Y22 [get_ports {dbgOutQ[0]}]

#create_clock -period 16.666 -name LVDS_bitClk_Pins -waveform {0.000 8.333} [get_ports {ADC_bitclk_N ADC_bitclk_P}]
#create_generated_clock -name adc_processClock -source [get_pins lvds_bitClk_BUFG_inst/O] -divide_by 2 [get_pins adc_processClock_reg/Q]
#create_clock -period 50.000 -name LVDS_frameClk_pins -waveform {0.000 25.000} [get_ports {ADC_frame_N ADC_frame_P}]
#create_generated_clock -name LVDS_bitClk_pins -source [get_ports ADC_frame_P] -multiply_by 6 [get_ports {ADC_bitclk_N ADC_bitclk_P}]
#set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets IBUFDS_adc_frame0_n_0_BUFG_inst_n_0]
#set_clock_groups -name lvds_clk_group -asynchronous -group [get_clocks {LVDS_bitClk_pins LVDS_frameClk_pins}]
#set_input_delay -clock LVDS_bitClk_Pins -max 3.000 [get_ports {ADC_qdataL_P ADC_qdataL_N ADC_idataL_P ADC_idataL_N}]
#create_clock -period 16.667 -name ADC_bitclk_P -waveform {0.000 8.334} [get_ports ADC_bitclk_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -clock_fall -min -add_delay 0.500 [get_ports ADC_idataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -clock_fall -max -add_delay 4.500 [get_ports ADC_idataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -min -add_delay 0.500 [get_ports ADC_idataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -max -add_delay 4.500 [get_ports ADC_idataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -clock_fall -min -add_delay 0.500 [get_ports ADC_qdataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -clock_fall -max -add_delay 4.500 [get_ports ADC_qdataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -min -add_delay 0.500 [get_ports ADC_qdataL_P]
#set_input_delay -clock [get_clocks ADC_bitclk_P] -max -add_delay 4.500 [get_ports ADC_qdataL_P]


create_clock -period 8.333 -name ADC_bitclk_P -waveform {0.000 4.167} -add [get_ports ADC_bitclk_P]
create_clock -period 25.000 -name ADC_frame_P -waveform {0.000 12.500} -add [get_ports ADC_frame_P]

set_input_delay -clock [get_clocks ADC_bitclk_P] -min 0.000 [get_ports ADC_idataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -max 1.000 [get_ports ADC_idataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -min 0.000 [get_ports ADC_idataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -max 1.000 [get_ports ADC_idataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -min 0.000 [get_ports ADC_qdataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -max 1.000 [get_ports ADC_qdataL_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -min 0.000 [get_ports ADC_qdataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -max 1.000 [get_ports ADC_qdataH_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -min 0.000 [get_ports ADC_frame_P]
set_input_delay -clock [get_clocks ADC_bitclk_P] -max 1.000 [get_ports ADC_frame_P]


set_output_delay -clock [get_clocks ADC_bitclk_P] 0.000 [get_ports {{dbgOutI[0]} {dbgOutI[1]} {dbgOutI[2]} {dbgOutI[3]} {dbgOutI[4]} {dbgOutI[5]} {dbgOutI[6]} {dbgOutI[7]} {dbgOutI[8]} {dbgOutI[9]} {dbgOutI[10]} {dbgOutI[11]} {dbgOutQ[0]} {dbgOutQ[1]} {dbgOutQ[2]} {dbgOutQ[3]} {dbgOutQ[4]} {dbgOutQ[5]} {dbgOutQ[6]} {dbgOutQ[7]} {dbgOutQ[8]} {dbgOutQ[9]} {dbgOutQ[10]} {dbgOutQ[11]}}]
set_output_delay -clock [get_clocks ADC_bitclk_P] 0.000 [get_ports dbgFrameRdy]


set_disable_timing [get_ports dbgFrameRdy]
set_disable_timing [get_ports {dbgOutI[0]}]
set_disable_timing [get_ports {dbgOutI[1]}]
set_disable_timing [get_ports {dbgOutI[2]}]
set_disable_timing [get_ports {dbgOutI[3]}]
set_disable_timing [get_ports {dbgOutI[4]}]
set_disable_timing [get_ports {dbgOutI[5]}]
set_disable_timing [get_ports {dbgOutI[6]}]
set_disable_timing [get_ports {dbgOutI[7]}]
set_disable_timing [get_ports {dbgOutI[8]}]
set_disable_timing [get_ports {dbgOutI[9]}]
set_disable_timing [get_ports {dbgOutI[10]}]
set_disable_timing [get_ports {dbgOutI[11]}]
set_disable_timing [get_ports {dbgOutQ[0]}]
set_disable_timing [get_ports {dbgOutQ[1]}]
set_disable_timing [get_ports {dbgOutQ[2]}]
set_disable_timing [get_ports {dbgOutQ[3]}]
set_disable_timing [get_ports {dbgOutQ[4]}]
set_disable_timing [get_ports {dbgOutQ[5]}]
set_disable_timing [get_ports {dbgOutQ[6]}]
set_disable_timing [get_ports {dbgOutQ[7]}]
set_disable_timing [get_ports {dbgOutQ[8]}]
set_disable_timing [get_ports {dbgOutQ[9]}]
set_disable_timing [get_ports {dbgOutQ[10]}]
set_disable_timing [get_ports {dbgOutQ[11]}]



#set_property LOC IDELAY_X1Y117 [get_cells IDELAYE2_frameClk]
#set_property LOC IDELAY_X1Y127 [get_cells IDELAYE2_qdataL]
#set_property LOC IDELAY_X1Y147 [get_cells IDELAYE2_idataL]

set_property PACKAGE_PIN U19 [get_ports {Jumpers[0]}]
set_property PACKAGE_PIN T19 [get_ports {Jumpers[1]}]
set_property PACKAGE_PIN U20 [get_ports {Jumpers[2]}]
set_property PACKAGE_PIN T20 [get_ports {Jumpers[3]}]
set_property PACKAGE_PIN V21 [get_ports {Jumpers[4]}]
set_property PACKAGE_PIN U21 [get_ports {Jumpers[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {Jumpers[0]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[5]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[4]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[3]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[2]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[1]}]
set_property PULLTYPE PULLUP [get_ports {Jumpers[0]}]

set_property PACKAGE_PIN V22 [get_ports dbgBitClk]
set_property IOSTANDARD LVCMOS33 [get_ports dbgBitClk]
set_property DRIVE 16 [get_ports dbgBitClk]
set_property SLEW FAST [get_ports dbgBitClk]

set_property MARK_DEBUG true [get_nets adc_frameStrobe]


